app/controllers/images_controller.rb

  def create
    @image = Image.new(params[:image])
    if @image.save
---
INSERT INTO "images" ("name", "content_type", "updated_at", "comment", "created_at", "data") VALUES('banner.png', 'image/png', '2010-01-28 01:43:05', NULL, '2010-01-28 01:43:05', '‰PNG

  def show
    @image = Image.find(params[:id])
---
SELECT * FROM "images" WHERE ("images"."id" = 1)

  def image
    @image = Image.find(params[:id])
---
SELECT * FROM "images" WHERE ("images"."id" = 2)